espressif/esp-idf/components/soc/esp32c6/register/soc/lp_io_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_IO_OUT_DATA_REG register
 *  need des
 */
#define LP_IO_OUT_DATA_REG (DR_REG_LP_IO_BASE + 0x0)
/** LP_IO_LP_GPIO_OUT_DATA : R/W/WTC; bitpos: [7:0]; default: 0;
 *  set lp gpio output data
 */
#define LP_IO_LP_GPIO_OUT_DATA    0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_M  (LP_IO_LP_GPIO_OUT_DATA_V << LP_IO_LP_GPIO_OUT_DATA_S)
#define LP_IO_LP_GPIO_OUT_DATA_V  0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_S  0

/** LP_IO_OUT_DATA_W1TS_REG register
 *  need des
 */
#define LP_IO_OUT_DATA_W1TS_REG (DR_REG_LP_IO_BASE + 0x4)
/** LP_IO_LP_GPIO_OUT_DATA_W1TS : WT; bitpos: [7:0]; default: 0;
 *  set one time output data
 */
#define LP_IO_LP_GPIO_OUT_DATA_W1TS    0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_W1TS_M  (LP_IO_LP_GPIO_OUT_DATA_W1TS_V << LP_IO_LP_GPIO_OUT_DATA_W1TS_S)
#define LP_IO_LP_GPIO_OUT_DATA_W1TS_V  0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_W1TS_S  0

/** LP_IO_OUT_DATA_W1TC_REG register
 *  need des
 */
#define LP_IO_OUT_DATA_W1TC_REG (DR_REG_LP_IO_BASE + 0x8)
/** LP_IO_LP_GPIO_OUT_DATA_W1TC : WT; bitpos: [7:0]; default: 0;
 *  clear one time output data
 */
#define LP_IO_LP_GPIO_OUT_DATA_W1TC    0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_W1TC_M  (LP_IO_LP_GPIO_OUT_DATA_W1TC_V << LP_IO_LP_GPIO_OUT_DATA_W1TC_S)
#define LP_IO_LP_GPIO_OUT_DATA_W1TC_V  0x000000FFU
#define LP_IO_LP_GPIO_OUT_DATA_W1TC_S  0

/** LP_IO_OUT_ENABLE_REG register
 *  need des
 */
#define LP_IO_OUT_ENABLE_REG (DR_REG_LP_IO_BASE + 0xc)
/** LP_IO_LP_GPIO_ENABLE : R/W/WTC; bitpos: [7:0]; default: 0;
 *  set lp gpio output data
 */
#define LP_IO_LP_GPIO_ENABLE    0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_M  (LP_IO_LP_GPIO_ENABLE_V << LP_IO_LP_GPIO_ENABLE_S)
#define LP_IO_LP_GPIO_ENABLE_V  0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_S  0

/** LP_IO_OUT_ENABLE_W1TS_REG register
 *  need des
 */
#define LP_IO_OUT_ENABLE_W1TS_REG (DR_REG_LP_IO_BASE + 0x10)
/** LP_IO_LP_GPIO_ENABLE_W1TS : WT; bitpos: [7:0]; default: 0;
 *  set one time output data
 */
#define LP_IO_LP_GPIO_ENABLE_W1TS    0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_W1TS_M  (LP_IO_LP_GPIO_ENABLE_W1TS_V << LP_IO_LP_GPIO_ENABLE_W1TS_S)
#define LP_IO_LP_GPIO_ENABLE_W1TS_V  0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_W1TS_S  0

/** LP_IO_OUT_ENABLE_W1TC_REG register
 *  need des
 */
#define LP_IO_OUT_ENABLE_W1TC_REG (DR_REG_LP_IO_BASE + 0x14)
/** LP_IO_LP_GPIO_ENABLE_W1TC : WT; bitpos: [7:0]; default: 0;
 *  clear one time output data
 */
#define LP_IO_LP_GPIO_ENABLE_W1TC    0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_W1TC_M  (LP_IO_LP_GPIO_ENABLE_W1TC_V << LP_IO_LP_GPIO_ENABLE_W1TC_S)
#define LP_IO_LP_GPIO_ENABLE_W1TC_V  0x000000FFU
#define LP_IO_LP_GPIO_ENABLE_W1TC_S  0

/** LP_IO_STATUS_REG register
 *  need des
 */
#define LP_IO_STATUS_REG (DR_REG_LP_IO_BASE + 0x18)
/** LP_IO_LP_GPIO_STATUS_INTERRUPT : R/W/WTC; bitpos: [7:0]; default: 0;
 *  set lp gpio output data
 */
#define LP_IO_LP_GPIO_STATUS_INTERRUPT    0x000000FFU
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_M  (LP_IO_LP_GPIO_STATUS_INTERRUPT_V << LP_IO_LP_GPIO_STATUS_INTERRUPT_S)
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_V  0x000000FFU
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_S  0

/** LP_IO_STATUS_W1TS_REG register
 *  need des
 */
#define LP_IO_STATUS_W1TS_REG (DR_REG_LP_IO_BASE + 0x1c)
/** LP_IO_LP_GPIO_STATUS_W1TS : WT; bitpos: [7:0]; default: 0;
 *  set one time output data
 */
#define LP_IO_LP_GPIO_STATUS_W1TS    0x000000FFU
#define LP_IO_LP_GPIO_STATUS_W1TS_M  (LP_IO_LP_GPIO_STATUS_W1TS_V << LP_IO_LP_GPIO_STATUS_W1TS_S)
#define LP_IO_LP_GPIO_STATUS_W1TS_V  0x000000FFU
#define LP_IO_LP_GPIO_STATUS_W1TS_S  0

/** LP_IO_STATUS_W1TC_REG register
 *  need des
 */
#define LP_IO_STATUS_W1TC_REG (DR_REG_LP_IO_BASE + 0x20)
/** LP_IO_LP_GPIO_STATUS_W1TC : WT; bitpos: [7:0]; default: 0;
 *  clear one time output data
 */
#define LP_IO_LP_GPIO_STATUS_W1TC    0x000000FFU
#define LP_IO_LP_GPIO_STATUS_W1TC_M  (LP_IO_LP_GPIO_STATUS_W1TC_V << LP_IO_LP_GPIO_STATUS_W1TC_S)
#define LP_IO_LP_GPIO_STATUS_W1TC_V  0x000000FFU
#define LP_IO_LP_GPIO_STATUS_W1TC_S  0

/** LP_IO_IN_REG register
 *  need des
 */
#define LP_IO_IN_REG (DR_REG_LP_IO_BASE + 0x24)
/** LP_IO_LP_GPIO_IN_DATA_NEXT : RO; bitpos: [7:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO_IN_DATA_NEXT    0x000000FFU
#define LP_IO_LP_GPIO_IN_DATA_NEXT_M  (LP_IO_LP_GPIO_IN_DATA_NEXT_V << LP_IO_LP_GPIO_IN_DATA_NEXT_S)
#define LP_IO_LP_GPIO_IN_DATA_NEXT_V  0x000000FFU
#define LP_IO_LP_GPIO_IN_DATA_NEXT_S  0

/** LP_IO_PIN0_REG register
 *  need des
 */
#define LP_IO_PIN0_REG (DR_REG_LP_IO_BASE + 0x28)
/** LP_IO_LP_GPIO0_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO0_SYNC_BYPASS_M  (LP_IO_LP_GPIO0_SYNC_BYPASS_V << LP_IO_LP_GPIO0_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO0_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO0_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO0_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO0_PAD_DRIVER_M  (LP_IO_LP_GPIO0_PAD_DRIVER_V << LP_IO_LP_GPIO0_PAD_DRIVER_S)
#define LP_IO_LP_GPIO0_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO0_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO0_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO0_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO0_INT_TYPE_M  (LP_IO_LP_GPIO0_INT_TYPE_V << LP_IO_LP_GPIO0_INT_TYPE_S)
#define LP_IO_LP_GPIO0_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO0_INT_TYPE_S  7
/** LP_IO_LP_GPIO0_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO0_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO0_WAKEUP_ENABLE_V << LP_IO_LP_GPIO0_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO0_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO0_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO0_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO0_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO0_FILTER_EN_M  (LP_IO_LP_GPIO0_FILTER_EN_V << LP_IO_LP_GPIO0_FILTER_EN_S)
#define LP_IO_LP_GPIO0_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO0_FILTER_EN_S  11

/** LP_IO_PIN1_REG register
 *  need des
 */
#define LP_IO_PIN1_REG (DR_REG_LP_IO_BASE + 0x2c)
/** LP_IO_LP_GPIO1_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO1_SYNC_BYPASS_M  (LP_IO_LP_GPIO1_SYNC_BYPASS_V << LP_IO_LP_GPIO1_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO1_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO1_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO1_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO1_PAD_DRIVER_M  (LP_IO_LP_GPIO1_PAD_DRIVER_V << LP_IO_LP_GPIO1_PAD_DRIVER_S)
#define LP_IO_LP_GPIO1_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO1_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO1_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO1_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO1_INT_TYPE_M  (LP_IO_LP_GPIO1_INT_TYPE_V << LP_IO_LP_GPIO1_INT_TYPE_S)
#define LP_IO_LP_GPIO1_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO1_INT_TYPE_S  7
/** LP_IO_LP_GPIO1_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO1_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO1_WAKEUP_ENABLE_V << LP_IO_LP_GPIO1_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO1_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO1_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO1_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO1_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO1_FILTER_EN_M  (LP_IO_LP_GPIO1_FILTER_EN_V << LP_IO_LP_GPIO1_FILTER_EN_S)
#define LP_IO_LP_GPIO1_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO1_FILTER_EN_S  11

/** LP_IO_PIN2_REG register
 *  need des
 */
#define LP_IO_PIN2_REG (DR_REG_LP_IO_BASE + 0x30)
/** LP_IO_LP_GPIO2_SYNC_BYPASS : R/W; bitpos: [1:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_SYNC_BYPASS    0x00000003U
#define LP_IO_LP_GPIO2_SYNC_BYPASS_M  (LP_IO_LP_GPIO2_SYNC_BYPASS_V << LP_IO_LP_GPIO2_SYNC_BYPASS_S)
#define LP_IO_LP_GPIO2_SYNC_BYPASS_V  0x00000003U
#define LP_IO_LP_GPIO2_SYNC_BYPASS_S  0
/** LP_IO_LP_GPIO2_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_PAD_DRIVER    (BIT(2))
#define LP_IO_LP_GPIO2_PAD_DRIVER_M  (LP_IO_LP_GPIO2_PAD_DRIVER_V << LP_IO_LP_GPIO2_PAD_DRIVER_S)
#define LP_IO_LP_GPIO2_PAD_DRIVER_V  0x00000001U
#define LP_IO_LP_GPIO2_PAD_DRIVER_S  2
/** LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR : WT; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR    (BIT(3))
#define LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR_M  (LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR_V << LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR_S)
#define LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR_V  0x00000001U
#define LP_IO_LP_GPIO2_EDGE_WAKEUP_CLR_S  3
/** LP_IO_LP_GPIO2_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_INT_TYPE    0x00000007U
#define LP_IO_LP_GPIO2_INT_TYPE_M  (LP_IO_LP_GPIO2_INT_TYPE_V << LP_IO_LP_GPIO2_INT_TYPE_S)
#define LP_IO_LP_GPIO2_INT_TYPE_V  0x00000007U
#define LP_IO_LP_GPIO2_INT_TYPE_S  7
/** LP_IO_LP_GPIO2_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_WAKEUP_ENABLE    (BIT(10))
#define LP_IO_LP_GPIO2_WAKEUP_ENABLE_M  (LP_IO_LP_GPIO2_WAKEUP_ENABLE_V << LP_IO_LP_GPIO2_WAKEUP_ENABLE_S)
#define LP_IO_LP_GPIO2_WAKEUP_ENABLE_V  0x00000001U
#define LP_IO_LP_GPIO2_WAKEUP_ENABLE_S  10
/** LP_IO_LP_GPIO2_FILTER_EN : R/W; bitpos: [11]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO2_FILTER_EN    (BIT(11))
#define LP_IO_LP_GPIO2_FILTER_EN_M  (LP_IO_LP_GPIO2_FILTER_EN_V << LP_IO_LP_GPIO2_FILTER_EN_S)
#define LP_IO_LP_GPIO2_FILTER_EN_V  0x00000001U
#define LP_IO_LP_GPIO2_FILTER_EN_S  11

