espressif/esp-idf/components/soc/esp32c6/register/soc/lp_io_reg.h
/** LP_IO_GPIO6_REG register
 *  need des
 */
#define LP_IO_GPIO6_REG (DR_REG_LP_IO_BASE + 0x60)
/** LP_IO_LP_GPIO6_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO6_MCU_OE_M  (LP_IO_LP_GPIO6_MCU_OE_V << LP_IO_LP_GPIO6_MCU_OE_S)
#define LP_IO_LP_GPIO6_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO6_MCU_OE_S  0
/** LP_IO_LP_GPIO6_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO6_SLP_SEL_M  (LP_IO_LP_GPIO6_SLP_SEL_V << LP_IO_LP_GPIO6_SLP_SEL_S)
#define LP_IO_LP_GPIO6_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO6_SLP_SEL_S  1
/** LP_IO_LP_GPIO6_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO6_MCU_WPD_M  (LP_IO_LP_GPIO6_MCU_WPD_V << LP_IO_LP_GPIO6_MCU_WPD_S)
#define LP_IO_LP_GPIO6_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO6_MCU_WPD_S  2
/** LP_IO_LP_GPIO6_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO6_MCU_WPU_M  (LP_IO_LP_GPIO6_MCU_WPU_V << LP_IO_LP_GPIO6_MCU_WPU_S)
#define LP_IO_LP_GPIO6_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO6_MCU_WPU_S  3
/** LP_IO_LP_GPIO6_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO6_MCU_IE_M  (LP_IO_LP_GPIO6_MCU_IE_V << LP_IO_LP_GPIO6_MCU_IE_S)
#define LP_IO_LP_GPIO6_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO6_MCU_IE_S  4
/** LP_IO_LP_GPIO6_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO6_MCU_DRV_M  (LP_IO_LP_GPIO6_MCU_DRV_V << LP_IO_LP_GPIO6_MCU_DRV_S)
#define LP_IO_LP_GPIO6_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO6_MCU_DRV_S  5
/** LP_IO_LP_GPIO6_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO6_FUN_WPD_M  (LP_IO_LP_GPIO6_FUN_WPD_V << LP_IO_LP_GPIO6_FUN_WPD_S)
#define LP_IO_LP_GPIO6_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO6_FUN_WPD_S  7
/** LP_IO_LP_GPIO6_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO6_FUN_WPU_M  (LP_IO_LP_GPIO6_FUN_WPU_V << LP_IO_LP_GPIO6_FUN_WPU_S)
#define LP_IO_LP_GPIO6_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO6_FUN_WPU_S  8
/** LP_IO_LP_GPIO6_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO6_FUN_IE_M  (LP_IO_LP_GPIO6_FUN_IE_V << LP_IO_LP_GPIO6_FUN_IE_S)
#define LP_IO_LP_GPIO6_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO6_FUN_IE_S  9
/** LP_IO_LP_GPIO6_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO6_FUN_DRV_M  (LP_IO_LP_GPIO6_FUN_DRV_V << LP_IO_LP_GPIO6_FUN_DRV_S)
#define LP_IO_LP_GPIO6_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO6_FUN_DRV_S  10
/** LP_IO_LP_GPIO6_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO6_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO6_MCU_SEL_M  (LP_IO_LP_GPIO6_MCU_SEL_V << LP_IO_LP_GPIO6_MCU_SEL_S)
#define LP_IO_LP_GPIO6_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO6_MCU_SEL_S  12

/** LP_IO_GPIO7_REG register
 *  need des
 */
#define LP_IO_GPIO7_REG (DR_REG_LP_IO_BASE + 0x64)
/** LP_IO_LP_GPIO7_MCU_OE : R/W; bitpos: [0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_OE    (BIT(0))
#define LP_IO_LP_GPIO7_MCU_OE_M  (LP_IO_LP_GPIO7_MCU_OE_V << LP_IO_LP_GPIO7_MCU_OE_S)
#define LP_IO_LP_GPIO7_MCU_OE_V  0x00000001U
#define LP_IO_LP_GPIO7_MCU_OE_S  0
/** LP_IO_LP_GPIO7_SLP_SEL : R/W; bitpos: [1]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_SLP_SEL    (BIT(1))
#define LP_IO_LP_GPIO7_SLP_SEL_M  (LP_IO_LP_GPIO7_SLP_SEL_V << LP_IO_LP_GPIO7_SLP_SEL_S)
#define LP_IO_LP_GPIO7_SLP_SEL_V  0x00000001U
#define LP_IO_LP_GPIO7_SLP_SEL_S  1
/** LP_IO_LP_GPIO7_MCU_WPD : R/W; bitpos: [2]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_WPD    (BIT(2))
#define LP_IO_LP_GPIO7_MCU_WPD_M  (LP_IO_LP_GPIO7_MCU_WPD_V << LP_IO_LP_GPIO7_MCU_WPD_S)
#define LP_IO_LP_GPIO7_MCU_WPD_V  0x00000001U
#define LP_IO_LP_GPIO7_MCU_WPD_S  2
/** LP_IO_LP_GPIO7_MCU_WPU : R/W; bitpos: [3]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_WPU    (BIT(3))
#define LP_IO_LP_GPIO7_MCU_WPU_M  (LP_IO_LP_GPIO7_MCU_WPU_V << LP_IO_LP_GPIO7_MCU_WPU_S)
#define LP_IO_LP_GPIO7_MCU_WPU_V  0x00000001U
#define LP_IO_LP_GPIO7_MCU_WPU_S  3
/** LP_IO_LP_GPIO7_MCU_IE : R/W; bitpos: [4]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_IE    (BIT(4))
#define LP_IO_LP_GPIO7_MCU_IE_M  (LP_IO_LP_GPIO7_MCU_IE_V << LP_IO_LP_GPIO7_MCU_IE_S)
#define LP_IO_LP_GPIO7_MCU_IE_V  0x00000001U
#define LP_IO_LP_GPIO7_MCU_IE_S  4
/** LP_IO_LP_GPIO7_MCU_DRV : R/W; bitpos: [6:5]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_DRV    0x00000003U
#define LP_IO_LP_GPIO7_MCU_DRV_M  (LP_IO_LP_GPIO7_MCU_DRV_V << LP_IO_LP_GPIO7_MCU_DRV_S)
#define LP_IO_LP_GPIO7_MCU_DRV_V  0x00000003U
#define LP_IO_LP_GPIO7_MCU_DRV_S  5
/** LP_IO_LP_GPIO7_FUN_WPD : R/W; bitpos: [7]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_FUN_WPD    (BIT(7))
#define LP_IO_LP_GPIO7_FUN_WPD_M  (LP_IO_LP_GPIO7_FUN_WPD_V << LP_IO_LP_GPIO7_FUN_WPD_S)
#define LP_IO_LP_GPIO7_FUN_WPD_V  0x00000001U
#define LP_IO_LP_GPIO7_FUN_WPD_S  7
/** LP_IO_LP_GPIO7_FUN_WPU : R/W; bitpos: [8]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_FUN_WPU    (BIT(8))
#define LP_IO_LP_GPIO7_FUN_WPU_M  (LP_IO_LP_GPIO7_FUN_WPU_V << LP_IO_LP_GPIO7_FUN_WPU_S)
#define LP_IO_LP_GPIO7_FUN_WPU_V  0x00000001U
#define LP_IO_LP_GPIO7_FUN_WPU_S  8
/** LP_IO_LP_GPIO7_FUN_IE : R/W; bitpos: [9]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_FUN_IE    (BIT(9))
#define LP_IO_LP_GPIO7_FUN_IE_M  (LP_IO_LP_GPIO7_FUN_IE_V << LP_IO_LP_GPIO7_FUN_IE_S)
#define LP_IO_LP_GPIO7_FUN_IE_V  0x00000001U
#define LP_IO_LP_GPIO7_FUN_IE_S  9
/** LP_IO_LP_GPIO7_FUN_DRV : R/W; bitpos: [11:10]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_FUN_DRV    0x00000003U
#define LP_IO_LP_GPIO7_FUN_DRV_M  (LP_IO_LP_GPIO7_FUN_DRV_V << LP_IO_LP_GPIO7_FUN_DRV_S)
#define LP_IO_LP_GPIO7_FUN_DRV_V  0x00000003U
#define LP_IO_LP_GPIO7_FUN_DRV_S  10
/** LP_IO_LP_GPIO7_MCU_SEL : R/W; bitpos: [14:12]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO7_MCU_SEL    0x00000007U
#define LP_IO_LP_GPIO7_MCU_SEL_M  (LP_IO_LP_GPIO7_MCU_SEL_V << LP_IO_LP_GPIO7_MCU_SEL_S)
#define LP_IO_LP_GPIO7_MCU_SEL_V  0x00000007U
#define LP_IO_LP_GPIO7_MCU_SEL_S  12

/** LP_IO_STATUS_INTERRUPT_REG register
 *  need des
 */
#define LP_IO_STATUS_INTERRUPT_REG (DR_REG_LP_IO_BASE + 0x68)
/** LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT : RO; bitpos: [7:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT    0x000000FFU
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT_M  (LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT_V << LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT_S)
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT_V  0x000000FFU
#define LP_IO_LP_GPIO_STATUS_INTERRUPT_NEXT_S  0

/** LP_IO_DEBUG_SEL0_REG register
 *  need des
 */
#define LP_IO_DEBUG_SEL0_REG (DR_REG_LP_IO_BASE + 0x6c)
/** LP_IO_LP_DEBUG_SEL0 : R/W; bitpos: [6:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_DEBUG_SEL0    0x0000007FU
#define LP_IO_LP_DEBUG_SEL0_M  (LP_IO_LP_DEBUG_SEL0_V << LP_IO_LP_DEBUG_SEL0_S)
#define LP_IO_LP_DEBUG_SEL0_V  0x0000007FU
#define LP_IO_LP_DEBUG_SEL0_S  0
/** LP_IO_LP_DEBUG_SEL1 : R/W; bitpos: [13:7]; default: 0;
 *  need des
 */
#define LP_IO_LP_DEBUG_SEL1    0x0000007FU
#define LP_IO_LP_DEBUG_SEL1_M  (LP_IO_LP_DEBUG_SEL1_V << LP_IO_LP_DEBUG_SEL1_S)
#define LP_IO_LP_DEBUG_SEL1_V  0x0000007FU
#define LP_IO_LP_DEBUG_SEL1_S  7
/** LP_IO_LP_DEBUG_SEL2 : R/W; bitpos: [20:14]; default: 0;
 *  need des
 */
#define LP_IO_LP_DEBUG_SEL2    0x0000007FU
#define LP_IO_LP_DEBUG_SEL2_M  (LP_IO_LP_DEBUG_SEL2_V << LP_IO_LP_DEBUG_SEL2_S)
#define LP_IO_LP_DEBUG_SEL2_V  0x0000007FU
#define LP_IO_LP_DEBUG_SEL2_S  14
/** LP_IO_LP_DEBUG_SEL3 : R/W; bitpos: [27:21]; default: 0;
 *  need des
 */
#define LP_IO_LP_DEBUG_SEL3    0x0000007FU
#define LP_IO_LP_DEBUG_SEL3_M  (LP_IO_LP_DEBUG_SEL3_V << LP_IO_LP_DEBUG_SEL3_S)
#define LP_IO_LP_DEBUG_SEL3_V  0x0000007FU
#define LP_IO_LP_DEBUG_SEL3_S  21

/** LP_IO_DEBUG_SEL1_REG register
 *  need des
 */
#define LP_IO_DEBUG_SEL1_REG (DR_REG_LP_IO_BASE + 0x70)
/** LP_IO_LP_DEBUG_SEL4 : R/W; bitpos: [6:0]; default: 0;
 *  need des
 */
#define LP_IO_LP_DEBUG_SEL4    0x0000007FU
#define LP_IO_LP_DEBUG_SEL4_M  (LP_IO_LP_DEBUG_SEL4_V << LP_IO_LP_DEBUG_SEL4_S)
#define LP_IO_LP_DEBUG_SEL4_V  0x0000007FU
#define LP_IO_LP_DEBUG_SEL4_S  0

/** LP_IO_LPI2C_REG register
 *  need des
 */
#define LP_IO_LPI2C_REG (DR_REG_LP_IO_BASE + 0x74)
/** LP_IO_LP_I2C_SDA_IE : R/W; bitpos: [30]; default: 1;
 *  need des
 */
#define LP_IO_LP_I2C_SDA_IE    (BIT(30))
#define LP_IO_LP_I2C_SDA_IE_M  (LP_IO_LP_I2C_SDA_IE_V << LP_IO_LP_I2C_SDA_IE_S)
#define LP_IO_LP_I2C_SDA_IE_V  0x00000001U
#define LP_IO_LP_I2C_SDA_IE_S  30
/** LP_IO_LP_I2C_SCL_IE : R/W; bitpos: [31]; default: 1;
 *  need des
 */
#define LP_IO_LP_I2C_SCL_IE    (BIT(31))
#define LP_IO_LP_I2C_SCL_IE_M  (LP_IO_LP_I2C_SCL_IE_V << LP_IO_LP_I2C_SCL_IE_S)
#define LP_IO_LP_I2C_SCL_IE_V  0x00000001U
#define LP_IO_LP_I2C_SCL_IE_S  31

/** LP_IO_DATE_REG register
 *  need des
 */
#define LP_IO_DATE_REG (DR_REG_LP_IO_BASE + 0x3fc)
/** LP_IO_LP_IO_DATE : R/W; bitpos: [30:0]; default: 35660032;
 *  need des
 */
#define LP_IO_LP_IO_DATE    0x7FFFFFFFU
#define LP_IO_LP_IO_DATE_M  (LP_IO_LP_IO_DATE_V << LP_IO_LP_IO_DATE_S)
#define LP_IO_LP_IO_DATE_V  0x7FFFFFFFU
#define LP_IO_LP_IO_DATE_S  0
/** LP_IO_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  need des
 */
#define LP_IO_CLK_EN    (BIT(31))
#define LP_IO_CLK_EN_M  (LP_IO_CLK_EN_V << LP_IO_CLK_EN_S)
#define LP_IO_CLK_EN_V  0x00000001U
#define LP_IO_CLK_EN_S  31

#ifdef __cplusplus
}
#endif
